W8D1/RedditClone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.sub_id = params[:sub_id]
        @post.user_id = current_user.id
        if @post.save
---
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 3], ["sub_id", 1], ["created_at", "2021-03-09 00:44:17.193281"], ["updated_at", "2021-03-09 00:44:17.193281"]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def show
        @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        @post = Post.find_by(id: params[:id])
        redirect_to sub_url(@post.sub_id)
        @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]

    def is_author?
        @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]