W8D1/RedditClone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = current_user.id
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "App Academy"], ["description", "What do you guys think?"], ["user_id", 1], ["created_at", "2021-03-08 19:35:02.796720"], ["updated_at", "2021-03-08 19:35:02.796720"]]

    def edit
        @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
        @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def index
        @subs = Sub.all
---
SELECT "subs".* FROM "subs"

    def destroy
        @sub = Sub.find_by(id: params[:id])
        if @sub
            @sub.destroy
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 2]]

    def is_moderator?
        @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def self.sub_ids
        Sub.all.pluck(:id, :title)
---
SELECT "subs"."id", "subs"."title" FROM "subs"

    def has_posts?
        @sub= Sub.find_by(id: params[:id])
        @sub.posts.any?
---
SELECT  1 AS one FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1 LIMIT $2  [["sub_id", 2], ["LIMIT", 1]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]