W8D1/RedditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
    def is_moderator?
        @sub = Sub.find_by(user_id: current_user.id)