W8D1/RedditClone/app/views/posts/_form.html.erb

SELECT "subs"."id", "name" FROM "subs"
---
        <label >Subs:
            <% SubsController.sub_ids.each do |id, name| %>