W11D2/skeleton 26/app/views/api/pokemon/show.json.jbuilder

SELECT "moves".* FROM "moves" INNER JOIN "poke_moves" ON "moves"."id" = "poke_moves"."move_id" WHERE "poke_moves"."pokemon_id" = $1  [["pokemon_id", 5]]
---
json.moves do
    @pokemon.moves.each do |move|

SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = $1  [["pokemon_id", 5]]
---
json.items do
    @pokemon.items.each do |item|