W11D2/skeleton 26/app/controllers/api/pokemon_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
    def index
        @pokemon = Pokemon.all

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        @pokemon = Pokemon.find_by(id: params[:id])