W11D4/BenchBnB/app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Fred2.0"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "sBkziUMwMVqsQxKPQ7cMcw"], ["updated_at", "2021-04-01 21:59:18.727155"], ["id", 1]]