W8D1/RedditClone/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "kQ6lOF1RVUlZo-3Ii34JmA"], ["updated_at", "2021-03-08 21:35:47.671538"], ["id", 1]]

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "theo"], ["LIMIT", 1]]