W7D3/GoalApp/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "QpS_n9zbgm8KUJ2bJkz25Q"], ["updated_at", "2021-03-04 02:14:40.737445"], ["id", 1]]